

courses = [

  {
    "code":"A5",
    "name":"Clock Mechanisms in Mammalian Neurons and Neuroendocrine Cells",
    "coordinators":["Prof. Eric Maronde"],
    "techniques":[
      'Molecular biology',
      'Biochemistry',
      'Cell culture',
      'Immunohistochemistry',
      'Neuroanatomy'
    ],
    "topics":[
      'Circadian rhythms in mammalian neurons'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":['https://www.izn-frankfurt.de/en/mitglied/maronde/'],
    "content":"The practical presents the basics of generating endogenous circadian rhythms in mammalian neurons. Here, the students analyze the cellular and molecular elements for chronobiological behaviour, working under supervision, and write up the results. Then the results obtained are presented in the form of a seminar talk. In a further seminar talk they present original research from the area of chrononeurobiology. The following techniques will be introduced: immunohistochemistry, protein gel electrophoresis, RNA extraction, RT-PCR, densitometry.",
    "objectives":"Basic knowledge about cell and molecular biology, basic skills in neuroanatomy of the mammalian brain, basics in chronobiological systems biology, learning to work on scientific questions based on relevant publications."
  },

  {
    "code":"A7",
    "name":"Neurobiology of the Nematode Caenorhabditis elegans",
    "coordinators":["Prof. Alexander Gottschalk"],
    "techniques":[
      'Genetic techniques',
      'Behavioral experiments',
      'Pharmacology',
      'Molecular biology',
      'Optogenetics (demo)',
      'Electrophysiology (demo)'
    ],
    "topics":[
      'Food-motivated behavior',
      'Neuromuscolar control',
      'Noiciception'
    ],
    "models":[
      'Roundworm (Caenorhabditis elegans)'
    ],
    "location":"Riedberg",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/gottschalk/',
      'https://www.bmls.de/Cellular_and_Molecular_Neurobiology/projects.html',
    ],
    "content":"This practical focuses on basic methods for investigating the nervous system of Caenorhabditis elegans. As well as more general molecular biology methods, this involves genetic methods (crosses, genotyping) as well as simple behaviour assays without and with the effect of specific agonists for ligand mediated ion channels (nicotinic acetylcholine receptors, GABA receptors) that are used for general characterization of the function of neuromuscular synapses. In addition, cell biology methods for expression analysis of transgenes (GTP-fusion proteins) or endogenous proteins (using specific antibodies) in relation to the genetic background are part of the lab’s standard repertoire. More specialised methods that are used are exogenous stimulation of neurons in C. elegans by light, transmitted by the transgene expressed, photo-activated cation channel rhodopsin-2, as well as electrophysiological conductance from C. elegans muscle cells (the latter only as a demonstration, since the method is too complicated to learn in 6 weeks). The students work on a current research project under the supervision of a PhD student and present the results in the form of a seminar talk. They learn how to present scientific work through writing up their result protocol."
    ,
    "objectives":"Familiarity with standard methods to analyse an invertebrate nervous system, genetic methods for making crosses, cell biology methods, molecular biology methods, learning to work on scientific questions based on relevant publications"
  },

  {
    "code":"A8",
    "name":"Neuropharmacology",
    "coordinators":["Prof. Jochen Klein"],
    "techniques":[
        'Disease models (in vivo, Stroke/Alzheimer\'s)',
        'Pharmacology',
        'Microdialysis (in vivo)',
        'Analytical chemistry (HPLC)',
        'Biochemistry (enzymatic assays)'
      ],

    "topics":[
      'Central cholinergic system in Alzheimer\'s disease',
      'Metabolism in ischemic and stroke conditions'
    ],
    "models":[
      'Rats (Rattus norvegicus)',
      'Mice (Mus musculus)'
    ],
    "location":"Riedberg",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/klein/',
      'https://www.uni-frankfurt.de/57955275/Prof__Dr__Jochen_Klein',
    ],
    "content":"This module teaches principles and methods of neuropharmacology. Our lab works with animal models of neurodegenerative disease such as stroke and dementia of the Alzheimer type. We use in vitro- as well as in vivomethods, with a focus on microdialysis which allows access to the extracellular fluid. In demonstrations and experiments, students will be trained to manufacture probes for microdialysis studies and will carry out measurements of neurotransmitters (e.g. acetylcholine, glutamate) and energy metabolites (glucose, lactate). Major topics will include investigations of the central cholinergic system and of the energy metabolism in the brain under ischemic conditions. The students will write protocols for their own work and will analyze their data both graphically and statistically in a way that would permit publication; thus, the students will learn basics of scientific work. The individual projects will be presented as seminar talks at the end of the module. In a further seminar talk, they will present an original piece of research (publication) from the field of neuropharmacology."
    ,
    "objectives":"Familiarity with biological and analytical experiments, basic knowledge in animal experimentation. Theory and practice of microdialysis, analysis of neurotransmitters and metabolites with chromatographic (HPLC) and enzymatic procedures. Addressing scientific questions with the help of relevant literature."
  },

  {
    "code":"A9",
    "name":"Cellular Physiology of Dopaminergic Neurons",
    "coordinators":["Prof. Jochen Roeper"],
    "techniques":[
        'Electrophysiology (in vitro)',
        'Electrophysiology (in vivo)',
        'Signal processing',
        'Computational modeling (Stochastic modeling)',
        'Immunohistochemistry',
        'Data analysis'
      ],
    "topics":[
      'Basal ganglia dopaminergic neurophysiology & patohysiology',
      'Parkinson\'s disease, schizophrenia, ADHD'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/roeper/'
    ],
    "content":"The practical covers basic electrophysiological single cell techniques (patch-clamp recordings & extracellular electrodes) of the dopaminergic midbrain system of mice in vivo and in vitro. The students work on their own projects under supervision and present their results in the form of a seminar talk. In a further seminar talk they present an original piece of research from the field of basal ganglia neurophysiology and pathophysiology (e.g. Parkinsos’s disease, schizophrenia, drug addiction). The main focuses are measuring and evaluating neuronal activity (current-clamp) and measuring (voltage-clamp) as well as biophysical and pharmacological characterisation of this neuronal activity mediated by synaptic and post-synaptic mechanisms (e.g. ion channels) with various configurations of the patch-clamp technique. This also includes using statistical evaluation methods. The students learn about the associated stochastic background and how to use the relevant software, which involves interdisciplinary cooperation with the BSc/MSc courses in mathematics."
    ,
    "objectives":"Familiarity with carrying out electrophysiological experiments, measuring and analysing electrical activity of dopaminergic neurons in vivo and in vitro, using and evaluating the patch-clamp technique to characterise biophysical and pharmacological properties of synaptic and post-synaptic ion channels. Combination of the patchclamp technique with neuroanatomical and immunohistological analyses. Basic computer modelling of neuronal activity. Stochastic description and statistical analysis of the recorded time sequence data. Understanding the molecular pathophysiological correlation between important diseases of the dopaminergic system and their corresponding mouse models."
  },

  {
    "code":"A10",
    "name":"Neurophysiology and Behaviour",
    "coordinators":["Prof. Bernd Gruenewald"],
    "techniques":[
        'Electrophysiology (in vitro)',
        'Electrophysiology (in vivo)',
        'Calcium imaging',
        'Cell culture (neuronal)',
        'Neuroanatomy',
        'Immunohistochemistry',
        'Microscopy (confocal)',
        'Behavioral experiments',
        'Data analysis'
      ],
    "topics":[
      'Ion channels and receptors functioning',
      'Neuromodulation',
      'Learning behavior',
      'Olfactory memory formation',
      'Social behavior of bees'
    ],
    "models":[
      'Honeybee (Apis mellifera)',
      'Fruitfly (Drosophila melanogaster)'
    ],
    "location":"Riedberg",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/gruenewald/'
    ],
    "content":"The practical investigates the neurophysiological basis of behaviour control. The students work on their own project on a theme defined together beforehand. The techniques that are taught include: cell physiology (patchclamp conductance, intracellular conductance, calcium imaging, cell culture); neuroanatomy (staining methods, brain preparation, confocal laser microscopy, fluorescence microscopy); behavioural experiments (behaviour pharmacology, extracellular conductance, learning and memory, social behaviour). Insects (honey bees, drosophila) are used as model organisms. The principle areas are: how ion channels and transmitter receptors work, neuromodulation, learning behaviour, olfactory memory formation, and social behaviour of bees. The students present their results in the form of a seminar talk and poster. In a further seminar talk they learn how to critically assess analytic physiological and behavioural research papers. These presentations are held in English and the students receive comprehensive feedback about the content and style of the presentation. They become familiar with writing a scientific publication by producing a protocol in the form of a paper. After the individual experimental steps have been explained, the students mostly work independently, from planning to carrying out, writing up and evaluating the research data."
    ,
    "objectives":"Planning, carrying out and evaluating neurobiology experiments, measuring ion flow; observing and quantifying behaviour; neuroanatomical methods. How to approach scientific questions, working with publications. Preparing scientific papers and presentations."

  },

  {
    "code":"A12",
    "name":"The Neuro-Vascular Interface",
    "coordinators":["PD Dr. Stefan Liebner"],
    "techniques":[
        'Genetic techniques',
        'Biochemistry',
        'Cell culture (primary, endothelial)',
        'Transgenic techniques',
        'Immunohistochemistry',
        'Microscopy (confocal, fixed/live-cell)'
      ],
    "topics":[
      'Development of brain vasculature',
      'Blood-brain-barrier morphogenesis'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/liebner/',
      'http://www.bbbsignaling.de/home.html'
    ],
    "content":"The practical course offers basic theoretical and experimental knowledge in the area of the brain vasculature in developmental and pathological neurobiology. Principal areas of research are the development and maintenance of the blood-brain barrier (BBB), and its relevance for neuronal function. The students take part on ongoing experiments in the laboratory to elucidate the molecular mechanisms of BBB formation. Their work may include: basic mouse genetics techniques and the handling of transgenic mice (various reporter mouse strains for the Wnt pathway as well as conditional/inducible gain- and loss-of-functions strains), processing of brain tissue for in situ hybridization and immunohistochemisty, isolation of primary cortical microvessels from mice, transfection and infection techniques, immunofluorescence, confocal and live-cell microscopy, biochemical techniques including protein gel electrophoresis, Western blot and immunoprecipitation. The results of the practical course are presented by every student on the form of a written protocol and a talk at the end of the course. The students also take part on the weekly lab meetings where they learn about the ongoing research of all the members of the group. In a Journal Club every student presents a recent publication on the field of their own projects."
    ,
    "objectives":"Students learn the basic techniques to study cellular and molecular Neurobiology (as detailed above). By the end of the course they have been in direct contact with mice and/or cells in vitro and they learn how to appropriately handle mouse tissue and cells for experiments. The students are in an international environment and learn how to write and communicate their results in English."

  },

  {
    "code":"A14",
    "name":"Embryonic and Adult Neurogenesis ",
    "coordinators":["Prof. Dorothea Schulte"],
    "techniques":[
        'Genetic techniques',
        'Biochemistry',
        'Cell culture (primary, neuronal)',
        'Transgenic techniques',
        'Immunohistochemistry',
        'Microscopy (confocal, fixed/live-cell)'
      ],
    "topics":[
      'Neurogenesis principles in vertebrates',
      'Cell fate specification and differentiation'
    ],
    "models":[
      'Mice (Mus musculus)',
      'Chicken (Gallus gallus domesticus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/schulte/'
    ],
    "content":"Topic of this practical course are principles of neurogenesis in vertebrates, with special focus on cell intrinsic mechanisms governing cell fate specification and differentiation of adult and embryonic stem- and progenitor cells in the brain. The students work on their own projects with supervision and present their results in the form of a seminar talk. In addition, one original publication from recent literature relevant to his/her research project will be presented and discussed. The results obtained during the course will be recorded in a written results protocol either in the form of a short research paper or of a short grant application in order to allow the students to gain first practical experience in these two important forms of scientific writing."
    ,
    "objectives":"The practical course teaches basic techniques in cellular and molecular developmental neuroscience. Model organisms used are mice and chick embryos. Emphasis will be placed on retroviral gene transfer in vivo and in vitro; working with cell lines and primary cell cultures (embryonic and adult neural stem and progenitor cells); biochemical techniques (sub cellular fractionation, protein purification); immunohistochemistry, in situ hybridization; working with transgenic animals."
  },

  {
    "code":"A15",
    "name":"Electrophysiological recordings in freely behaving animals",
    "coordinators":["Dr. Torfi Sigurdsson"],
    "techniques":[
        'Study design',
        'Behavioral experiments (spatial working memory)',
        'Electrophysiology (in vivo, free-behavior)',
        'Signal processing (Spike and LFP extraction)',
        'Data analysis'
      ],
    "topics":[
      'Neuronal coordination across brain regions',
      'Spatial working memory',
      'Schizophrenia'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/sigurdsson/'
    ]
    ,
    "content":"This practical will introduce students to the techniques used to examine neural activity in freely behaving animals. Students will record neural activity extracellularly from the hippocampus of mice performing a spatial working memory task and analyze the neural data in relation to the animal’s behavior. Students will learn how to train animals to perform a behavioral task, how to perform extracellular recordings in freely behaving animals; how to extract the spiking of individual neurons as well as local field potentials from the neural data; and how to analyze these signals in relation to each other and the animals’ behavior. Students will present the data they have collected and analyzed at the end of the practical. In addition, they are required to present one recent paper that is relevant to the work in a journal club."
    ,
    "objectives":"Behavioral training; basic knowledge of techniques used to record and analyze neural activity from freely behaving animals; ability to generate scientific hypotheses based on previous literature and design experiments to test them."

  },

  {
    "code":"A17",
    "name":"Auditory Function and Dysfunction: Behavior and Physiology",
    "coordinators":["PD Dr. Bernhard Gaese"],
    "techniques":[
      'Study design',
        'Animal handling',
        'Surgery',
        'Pharmacology',
        'Behavioral experiments',
        'Electrophysiology (in vivo)',
        'Signal processing',
        'Data analysis'
      ],
    "topics":[
      'Auditory perception',
      'Auditory disorders (tinnitus, hearing loss)',
      'Behavioral/pharmachological treatments'
    ],
    "models":[
      'Rats (Rattus norvegicus)',
      'Gerbil (Meriones unguiculatus)'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/gaese/'
    ],
    "content":"The practical teaches techniques to determine auditory function and dysfunction in rodents. These techniques can be used to determine effects of pharmacological or behavioral treatments of sensory disorders such as tinnitus or hearing loss. The focus is on behavioral techniques suitable to characterize the disorder rather precisely in comparison to normal functions. All steps that are necessary for a project in the field are taught in this practical: study design, animal handling, control of experimental parameters, pharmacological treatment of animals, and data analysis. The behavioral analysis is paralleled by basic electrophysiological measurements necessary to determine the effects of dysfunction and treatments at the physiological level. The students work on their own projects under supervision and present their results in the form of a seminar talk. The main focuses are: measuring and analyzing behavioral data, performing efficient physiological experiments to determine auditory function, and statistical evaluation methods. Preparation of a potential publication will be the final part of the project. After completion, the individual projects will be presented and discussed in the form of a seminar talk. In a further seminar talk the students will present an original piece of research from the area of cognition and hearing."
    ,
    "objectives":"Familiarity with carrying out well controlled behavioral experiments (animal handling, measuring and analyzing behavioral data, statistical analysis). Performing physiological measurements including electrophysiological recording in minimally invasive preparations. Additional aspects are: introduction to software for data handling, signal processing, and graphical display. Deriving scientific questions from the current literature. Knowledge about the usage and limitations of animal models for neurological diseases."

  },

  {
    "code":"A18",
    "name":"Information Processing in the Central Auditory System",
    "coordinators":["PD Dr. Bernhard Gaese"],
    "techniques":[
        'Animal handling',
        'Surgery',
        'Behavioral experiments',
        'Electrophysiology (in vivo)',
        'Signal processing',
        'Data analysis'
      ],
    "topics":[
      'Auditory perception',
      'Top-down influences on hearing',
      'Context-dependent processing of auditory signals'
    ],
    "models":[
      'Rats (Rattus norvegicus)',
      'Gerbil (Meriones unguiculatus)'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/gaese/'
    ],
    "content":"The practical covers the whole range of techniques to investigate brain activity underlying the processing of sensory information in the auditory domain. The focus is on electrophysiological single cell techniques in rodents in the awake and anesthetized preparations. Brain activity is acquired and analyzed with the goal to understand behavioral responses following auditory stimulation. Cognitive aspects (e.g. context-dependence) are taken into account. The students work on their own projects under supervision and present their results in the form of a seminar talk. The main focuses are measuring and analyzing neuronal activity in different configurations of in-vivo recording techniques. The following analysis includes modern techniques of signal processing, efficient handling of larger data sets and statistical evaluation methods. Preparation of a potential publication will be the final part of the project After completion, the individual projects will be presented and discussed in the form of a seminar talk. In a further seminar talk the students will present an original piece of research from the area of cognition and hearing."
    ,
    "objectives":"Familiarity with carrying out physiological experiments (animal handling, surgery, measuring and analyzing electrical activity at the single neuron level. Combining physiology with neuroanatomical and histological staining techniques. Basic introduction to behavioral control. Introduction to software for data handling, signal processing, statistical analysis and graphical display. Understanding cognitive influences on sensory information processing as an important aspect of context-dependent behavior. Deriving scientific questions from the current literature."

  },

  {
    "code":"A19",
    "name":"Neuronal basis of acoustic communication in mammals",
    "coordinators":["Dr. Julio Hechavarria",'Prof. Manfred Koessl'],
    "techniques":[
        'Bioacoustics',
        'Animal handling',
        'Surgery',
        'Electrophysiology (in vivo)',
        'Signal processing',
        'Data analysis',
        'Programming (Matlab)'
      ],
    "topics":[
      'Auditory perception',
      'Top-down influences on hearing',
      'Context-dependent processing of auditory signals'
    ],
    "models":[
      'Bats (Carollia perspicillata)',
      'Gerbil (Meriones unguiculatus)'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/hechavarria/',
      'https://www.julio-hechavarria.com/'
    ],
    "content":"The main goal of this course is to understand how mammals communicate using acoustic information (sounds). The course is designed from the perspective of the “broadcaster-receiver” approach, and therefore it is consequently subdivided into two parts. The first part is meant for understanding the sounds broadcasted by two mammalian species (Mongolian gerbils and bats) while they are communicating. Basically, using bioacoustics tools, the students will try to figure out the vocal alphabet of bats and gerbils. The second part of the course deals with the receiver. In this part, the students will learn how the gerbil’s voice is processed in the brain by neurons located in the auditory cortex. The main aim here is to assess what happens in the brain when an animal hears a behaviorally relevant sound. At the beginning of each course part, there will be introductory discussions that will provide the students with the necessary theoretical background for conducting and understanding the different experiments. An introduction to statistics and to MATLAB will also be offered. The final report will be written in the form of a scientific paper, and the results will be presented in the form of a short talk."
    ,
    "objectives":"By the end of the course, the students should be able to: (1) Understand basic concepts of bioacoustics such as the sound as a mechanical wave, sound transduction using microphones, analog-to-digital conversion using sound cards. (2) Measure basic parameters of a sound wave (frequency, duration, intensity). (3) Perform basic surgeries required for acquiring neuronal data. (4) Understand basic neuroscience concepts such as: action potential, local field potential, receptive field, brain topography, spike clustering, brain oscillations. (5) Testing hypothesis using basic statistical tests (normality tests, parametric and non-parametric t-tests and analyses of variance (ANOVA))."

  },

  {
    "code":"A21",
    "name":"Cellular, molecular and systemic Neurobiology in mouse and zebrafish",
    "coordinators":["Prof. Amparo Acker-Palmer",'Dr. Bettina Kirchmaier'],
    "techniques":[
        'Genetic techniques (mice)',
        'Immunohistochemistry',
        'Cell culture (neuronal/endothelial)',
        'Microscopy (confocal)',
        'Biochemistry',
        'Genetic techniques (zebrafish)',
        'Microscopy (stereo)',
        'Molecular biology',
        'Behavioral experiments',
        'Data analysis'
      ],

    "topics":[
      'Molecular mechanisms of cell-cell communication (ephrin/Eph system)',
      'Neurovascular interface function and development'
    ],
    "models":[
      'Mice (Mus musculus)',
      'Zebrafish (Danio rerio)'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/acker-palmer/',
      'https://sites.google.com/view/neuro-vessel-frankfurt/home'
    ],
    "content":"The practical course offers basic theoretical and experimental knowledge in the area of cellular, molecular and systemic neurobiology in mouse and zebrafish. The students work on their own projects under supervision and present the results in the form of a seminar talk. In a second seminar talk they present an original publication from the field of their projects. By writing a result protocol, they will learn how to write scientific reports. The practical course is divided in two units. The first part includes the following tasks: basic mouse genetic techniques, processing of brain tissue for immunohistochemistry, basic techniques of working with neuronal cell cultures, immunofluorescence microscopy, confocal microscopy, and biochemical techniques including protein gel electrophoresis and Western blotting. In the second part of the practical course, the students will be introduced to basic zebrafish genetics using methods in molecular biology and histological techniques, confocal microscopy and brightfield microscopy as well as zebrafish embryo manipulation and basic behavioral tests."
    ,
    "objectives":"Students learn the basic techniques for studying cellular, molecular, and systemic neurobiology (as detailed above). They work with cultured cells under sterile conditions, with the epifluorescence microscope and the stereo microscope. The students will be trained in zebrafish embryo handling and basic genetic techniques, and quantify and analyse the obtained data and images. The students are in an international environment and learn how to write and communicate their results in English."

  },

  {
    "code":"A22",
    "name":"Optogenetics and calcium recordings in freely behaving animals",
    "coordinators":["Dr. Sevil Duvarci"],
    "techniques":[
        'Study design',
        'Optogenetics',
        'Calcium imaging (in vivo, fiber photometry, free-behavior)',
        'Behavioral experiments',
        'Signal processing',
        'Data analysis'
      ],

    "topics":[
      'Midbrain dopamine system',
      'Fear circuits',
      'Schizophrenia'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/duvarci/'
    ],
    "content":"The aim of this practical module will be to introduce students to optogenetics and fiber photometry techniques in freely behaving animals performing behavioral tasks. The students will learn how to perform chronic surgeries for viral injections and optical fiber implantations; how to perform behavioral tasks; how to run optogenetic experiments in freely behaving animals; how to perform calcium recordings in freely behaving animals using fiber photometry; and how to analyze calcium signals in relation to animal’s behavior. The optogenetic manipulations and calcium recordings will mainly be performed in the midbrain dopamine system while animals perform behavioral tasks such as reward learning paradigms. At the end of the module, the students will present the results of the experiments they performed."
    ,
    "objectives":"The students will learn the basics of performing behavioral tasks and optogenetic and calcium recording experiments in freely behaving animals. They will learn how to design experiments to test specific hypotheses."

  },

  {
    "code":"A23",
    "name":"Cellular and molecular mechanisms in neurovascular disorders",
    "coordinators":["Dr. Jasmin Hefendehl"],
    "techniques":[
        'Genetic techniques (demo)',
        'Biochemistry',
        'Immunohistochemistry',
        'Cell culture (neuronal)',
        'Microscopy',
        'Microscopy (in vivo 2-photon, DEMO)',
        'Image processing',
        'Data analysis'
      ],

    "topics":[
      'Comorbidity of Alzheimer\'s disease and neurovascular diseases'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Riedberg",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/hefendehl/'
    ],
    "content":"The practical course offers basic theoretical and experimental knowledge in the area of neurodegenerative and vascular disorders. The students work on their own projects under supervision and present the results in the form of a seminar talk. This talk also includes an original publication from the field of their projects. By writing a result protocol, they will learn how to write scientific reports. The practical course consists of systemic, cellular and molecular aspects that will be addressed using transgenic mouse models. This includes the following techniques: in vivo 2-Photon Microscopy, Image- and data analysis, basic mouse genetic techniques, processing of brain tissue for immunohistochemistry, basic primary cell culture techniques, immunofluorescence microscopy, confocal microscopy as well as biochemical techniques including protein gel electrophoresis and Western blotting."
    ,
    "objectives":"In this elective module the student will learn fundamental techniques used to in the research area of neurodegenerative disorders (as described above). In vivo 2-Photon imaging enables us to record systemic as well as cellular processes in real time. The students are presented with the opportunity to observe in vivo animal handling and the live imaging process. The acquired data will be analyzed by the students, teaching them basic Image- and data analysis skills. The immunohistochemical stainings of brain sections will teach the students the technique as well as the underlying scientific question of the experiment. Moreover, the students will work with cultured cells under sterile conditions, with the epifluorescence – and stereo microscope. The students are in an international environment and learn how to write and communicate their results in English."
  },

  {
    "code":"A24",
    "name":"Deciphering brain activity during natural behaviour in real time",
    "coordinators":["Dr. Martha Havenith","Dr Marieke Scholvinck"],
    "techniques":[
        'Animal handling',
        'Surgery',
        'Behavioral experiments',
        'Electrophysiology (in vivo)',
        'Psychophysics (humans, VR)',
        'Programming (Python/Matlab)',
        'Statistics',
        'Data analysis'
      ],

    "topics":[
      'Parallel/distibuted processing in complex cognition',
      'Visually-guided decision making',
      'Learning and attention',
      'Virtual-Environment-Foraging Task'
    ],
    "models":[
      'Mice (Mus musculus)',
      'Rhesus macaque (Macaca mulatta)',
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.esi-frankfurt.de/research/havenith-scholvinck-lab/'
    ],
    "content":"Humans may not be good at multitasking – but their brains are! Cognitive processes such as learning and attention are often represented in the same brain areas, at the same time. Previous research has overwhelmingly focused on how each of these processes affects neuronal activity in isolation. In contrast, in our lab we study how neuronal activity represents such cognitive processes simultaneously, and whether this is evolutionarily preserved or varies across species. For this, we conduct parallel experiments in monkeys and mice. These animals are trained to do naturalistic foraging tasks in a virtual environment, while we record the activity of large neuronal populations in their visual system. Since the lab is still in the build-up phase, what you would do is various. Depending on when you come, you get experience in mouse/monkey handling and training, Matlab/Python programming, psychophysics, virtual reality (VR), and in-vivo electrophysiology."
    ,
    "objectives":"In this elective module the students will get exposed to all the techniques necessary for in-vivo electrophysiology: handling of animals (mice and/or monkeys), training the animals on a natural task in a virtual environment, surgeries to implant electrodes, and electrophysiological recordings from these electrodes as the animals are doing their task. In addition, the students can do some psychophysics on human subjects in the VR, and they will get their own data analysis project, which will allow them to learn Matlab/Python programming. The students are in an international environment and learn how to write and communicate their results in English."
  },

  {
    "code":"A25",
    "name":"Neuroscience of Navigation and Self-Motion",
    "coordinators":["Dr. Jean Laurens "],
    "techniques":[
        'Chronic electrode implantation',
        '3D motion tracking',
        'Electrophysiology (data analysis)',
        'Computational modelling (Bayesian)',
        'Mathematical modelling (Bayesian)',
        'Data analysis'
      ],

    "topics":[
      'Navigation',
      'Self-motion sensation',
      'Cerebellar physiology',
      'Bayesian modeling'
    ],
    "models":[
      'Marmoset monkey'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.esi-frankfurt.de/people/jeanlaurens/',
      'https://www.esi-frankfurt.de/research/laurens-lab/'
    ],
    "content":"We interact with the world by moving and navigating through it, whenever we go to our kitchen or explore a new shopping mall; and whenever we drive a car or climb a mountain trail. Labour group studies the brain circuits responsible for sensing our own body’s motion, controlling balance, and finding one’s way through the word. We perform neuronal recordings in small squirrel-sized monkeys, the Marmosets, in experiments where they can be seated in moving platforms or move freely in natural cages. We are also a computational lab where we develop models of self-motion sensation, based in particular on the Bayesian formalism. A tour in the lab will allow you to learn about the techniques of extracellular recordings and neuronal data analysis, about motion and navigation science, and about theoretical and systems neuroscience. The students will discuss with Dr. Laurens to define a research in project in one of the lab’s thematic: navigation (head direction cells system), selfmotion (vestibular system), cerebellar physiology, Bayesian modeling."
    ,
    "objectives":"In this elective module the students will get exposed to the techniques of system neuroscience: design and operation of chronic implants; analysis of neuronal spiking data and LFP; 3D motion tracking and analysis, programming of robotic platforms. They will also learn about one of the lab’s scientific fields: navigation, selfmotion sensation, cerebellar physiology, Bayesian modeling. Note that direction participation to experiments with monkeys is not possible since the mandatory training typically takes longer than 4 months to complete. The students are in an international environment, they write and communicate their results in English."
  },

  {
    "code":"B2",
    "name":"Physiology and Pharmacology of Pain",
    "coordinators":["Prof. Dr. Ellen Niederberger"],
    "techniques":[
      'Disease models (in vivo/in vitro)',
        'Behavioral experiments (pain)',
        'Immunohistochemistry',
        'Cell culture (neuronal)',
        'Calcium imaging',
        'Pharmacology',
        'Molecular biology',
        'Biochemistry'
      ],

    "topics":[
      'Pain and inflammation'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/niederberger/'
    ],
    "content":"The practical focuses on basic methods for investigating principle mechanisms of pain and inflammation. For this purpose, various animal and cell culture models are applied and, by the use of knock-out models or pharmacological intervention, novel treatment strategies are examined. The students perform individual studies under supervision. The results will be documented in a protocol and presented and discussed in a seminar talk at the end of the practical. The experiments comprise behavioral experiments with mice, tissue preparation, cultivation and stimulation of cells, preparation of protein and RNA from these materials, PCR und Western-Blot analysis."
    ,
    "objectives":"Familiarity with several of the following areas: various experimental pain models in mice, observing the behaviour of mice, preparing tissue for immunohistochemistry and Western blots, setting up neuronal cell culture, introduction to calcium imaging, measuring primary sensory neurons and pharmacological effects, learning about in vitro cell culture models for investigating the pharmacology of inflammatory mechanisms, measuring mediators of inflammation in a cell culture model, preparing one’s own results in the form of a talk and written protocol."

  },

  {
    "code":"B4",
    "name":"Plasticity in Hippocampus : Morphology, Physiology, and Clinical Relevance",
    "coordinators":["Prof. Thomas Deller"],
    "techniques":[
        'Organotypic slice cultures',
        'Immunohistochemistry',
        'Optogenetics',
        'Microscopy (confocal, fixed/live-cell)',
        'Electrophysiology (in vitro)',
        'Pharmacology',
        'Molecular biology'

      ],

    "topics":[
      'Hippocampal response to CNS damage',
      'Hippocampal cell network dynamics',
      'Molecular basis of hippocampal plasticity'
    ],
    "models":[
      'Mice (Mus musculus)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/deller/'
    ],
    "content":"The practical course and seminars provide an interdisciplinary overview of neural plasticity in the hippocampus. The main topics of research comprise morphological and physiological responses of hippocampal neurons to CNS damage or neuronal (over-) stimulation, cellular network dynamics, as well as the underlying molecular mechanisms of hippocampal plasticity and homeostasis. To study these processes, we use the model of organotypic slice cultures of the hippocampus. Experimental techniques include optogenetic manipulation of cell activity, live-cell and fixed tissue imaging (confocal microscopy), immunocytochemistry, patch-clamp, pharmacology, and molecular biology methods. Students will learn appropriate techniques within a current research project, conduct their own experiments under supervision, and present their scientific work in a seminar talk. The accompanying seminars will give insights into relevant current publications, experimental models, and research methods and consider their relevance in clinical translation."
    ,
    "objectives":"Students will gain knowledge and training in basic anatomical and physiological techniques, cell culture, and confocal microscopy and learn how to work on scientific questions based on relevant publications."

  },

  {
    "code":"B6",
    "name":"Brain Damage and Neuroprotection",
    "coordinators":["Prof. Donat Kogel","Prof. Abdelhaq Rami"],
    "techniques":[
        'Cell culture',
        'Disease models (in vivo/in vitro, ischemia)',
        'Disease models (in vitro, stress stimuli)',
        'Microscopy (confocal, fixed/live-cell)',
        'Pharmacology'
      ],

    "topics":[
      'Cell stress and death',
      'Autophagy in cerebral ischemia'
    ],
    "models":[
      'Rats (Rattus norvegicus)'
    ],
    "location":"Niederrad",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/deller/'
    ],
    "content":"The practical involves experiments using the following methods: cultivating neuronal cells (primary cells and neuronal cell lines), inducing ischemia in vivo in rats, in vitro hypoxia/ischemia, application of further stress stimuli in vitro, assessing neuronal cell death and neuroprotection by cytokines and pharmaceuticals in vitro and in vivo, detecting proteins and other compounds in the cell using fluorescence and laser scanning microscopy, transcriptional stress responses in neurons as well as transfection techniques and live cell imaging."
    ,
    "objectives":"Familiarity with cell culture techniques and molecular biological techniques in experimental neurosciences, knowledge about anesthetising and surgical approaches in animal experiments, learning how to work on scientific questions based on relevant publications."

  },

  {
    "code":"B7",
    "name":"Clinical Paediatric Neurology",
    "coordinators":["Prof. Dr. Matthias Kieslich"],
    "techniques":[
        'Clinical evaluation (Developmental neurological)',
        'Clinical evaluation (Neuropsychological)',
        'Electrophysiology (EEG, Evoked-potentials)',
        'Neuroimaging (Neurography)',
        'Neuroimaging (Sonography)'
      ],

    "topics":[
      'Epilepsy',
      'Neuronal metabolism',
      'Neurooncology',
      'Neurotraumatology',
      'Non-accidental child injuries (abuse)',
      'Ataxia teleaniectasia'
    ],
    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/kieslich/'
    ],
    "content":"The practical investigates neurological questions in children. The main themes are developmental neurobiology in the first year of life, applied neurophysiology in children, neuropaedriatric medicine including epilepsy syndromes and neurotraumatology. The students take part in relevant investigations, write up an experimental protocol and present their results in the form of a seminar talk. They give an additional seminar talk on recent original research papers."
    ,
    "objectives":"Familiarity with standard methods in clinical neuropaediatry, acquiring experience in handling patients as well as classifying typical clinical symptoms, learning how to work on scientific questions based on relevant publications."

  },

  {
    "code":"B8",
    "name":"Clinical Neuroimaging",
    "coordinators":["Prof. Dr. Joachim Berkefeld"],
    "techniques":[
        'Neuroimaging (Molecular resonance tomography [MRT])',
        'Neuroimaging (Computed tomography [CT])',
        'Neuroimaging (Digital subtraction angiography [DSA])',
      ],

    "topics":[
      'Neuroanatomy',
      'Imaging techniques'
    ],
    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/'
    ],
    "content":"The practical provides an introduction to basic image analysis, image interpretation and acquiring data by examining the CNS (cerebral and spinal) with neuroradiological imaging procedures. The following procedures are used: molecular resonance tomography (MRT) of the head and spinal column, computer tomography (CT) of the skull and spinal column, digital cerebral and spinal subtraction angiography (DSA) as well as an introduction to basic neuroradiological intervention measures. In addition, the practical presents the theoretical / physical background to individual analysis procedures in neuroradiology focussing on nuclear resonance tomography. This will deal with the physical basis of MRT / image composites, sequences and sequence parameters of MRT, diffusion and perfusion weighted MRT imaging, tractography (fibre tracking), functional MRT (fMRT), nuclear resonance spectroscopy analysis (MR spectroscopy). The students compile a written protocol on the investigations carried out and present this along with the theoretical background in the form of a seminar talk."
    ,
    "objectives":"Familiarity with neuroanatomy (cerebral/spinal) as well as the skull and spinal column; basic knowledge about relevant neurological diseases. Learning about indications for neuroradiological examination, acquiring and interpreting images as well as assigning them to typical individual clinical pictures."

  },

  {
    "code":"B9",
    "name":"Clinical Auditory Neuroscience",
    "coordinators":["Prof. Uwe Baumann"],
    "techniques":[
        'Clinical audiology (Psychoacoustics)',
        'Clinical audiology (Brainstem recording techniques)',
        'Clinical audiology (Audiometry)',
        'Clinical audiology (Hearing aids and implants)',
        'Statistics',
        'Data analysis',
        'Programming'
      ],

    "topics":[
      'Auditory processing and impaired hearing',
      'hearing aids and cochlear implants',
      'electrical stimulation of the auditory system'
    ],
    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/baumann/',
      'https://www.kgu.de/index.php?id=108'
    ],
    "content":"The practical teaches most important basics of objective and subjective audiometric measurement techniques to assess hearing disorders. Pure tone and speech audiometry as well as clinical application of otoacoustic emissions, impedance measurements of the eardrum, and different methods of auditory brainstem response recording (BERA, CERA, ASSR, MMN) shall be demonstrated. The fitting of implantable hearing aids and cochlear implants will be shown in different patients. Intra-operative assessment of neuro-physiological auditory responses will be also part of the practical. The students work on their own projects with supervision, and present their results in the form of a seminar talk. In a further seminar talk they present an original piece of research from the field of neuro-physiological stimulation/recording of auditory responses. They learn how to present scientific work through writing up an appropriate result protocol. The main topics are: psychoacoustic measurements of auditory perception with electrical stimulation by means of cochlear implants, investigation of different recording techniques to assess frequency specific responses of the auditory system, use of computer/software in evaluating data and generating stimuli."
    ,
    "objectives":"Familiarity with carrying out psycho-acoustical experiments, measuring auditory brainstem responses, basics of audiometry, learning how to work on scientific questions based on relevant publications."

  },

  {
    "code":"B10",
    "name":"Experimental and Translational Psychiatry",
    "coordinators":["Prof. David Slattery"],
    "techniques":[
      'Cell culture',
        'Molecular biology',
        'Immunohistochemistry',
        'Histology',
        'Microscopy',
        'Pharmacology',
        'Behavioral experiments',
        'Electrophysiology (EEG, MEG, DEMO)',
        'Neuroimaging (fMRI, DEMO)'
      ],

    "topics":[
      'Psychiatric disorders in mice models and humans',
      'Role of neuropeptides in anxiety/affective disorders',
      'Molecular basis of social anxiety',
      'Sex-differences in stress disorders'
    ],
    "models":[
      'Mice (Mus musculus)',
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/slattery/',
      'https://www.kgu.de/einrichtungen/kliniken/zentrum-fuer-psychische-gesundheit/psychiatrie-psychosomatik-und-psychotherapie/team/professuren/prof-dr-david-slattery/'
    ],
    "content":"The aim of this practical is to introduce students to a wide-range of experimental techniques that are used to study psychiatric disorders from the bench to the bedside. The wide variety of translational projects that students can participate in include cell culture techniques to functionally evaluate gene candidates identified from studies in large cohorts of patients, the assessment of the effect of drug targeted, viral vector targeted or knockout mice in behavioural tests relevant for psychiatric disorders. After such experiments, a variety of immunohistochemical and histological characterisations are performed. There is also the possibility to gain insight into how neuroimaging methods, such as functional magnetic resonance imaging, electroencephalography and magnetoencephalography are used to assess aberrant neural processing and coordination in psychiatric disorders"
    ,
    "objectives":"Students will receive training in a range of molecular and behavioural techniques commonly used to study psychiatric disorders and design experiments using the knowledge gained. They will also receive basic knowledge about the disorders, particularly mood and anxiety disorders, schizophrenia and attention-deficit hyperactivity disorder, in a series of seminars and journal clubs (including the option to participate in case presentations)."

  },

  {
    "code":"B11",
    "name":"Neurobiological human cell models",
    "coordinators":["Prof. Dr. Andreas Chiocchetti"],
    "techniques":[
        'Disease models (in vitro, ASD/ADHD/CD)',
        'Cell culture',
        'Genetic techniques',
        'Molecular biology (incl. CRISPR-Cas9)',
        'Biochemistry (light-based assays)',
        'Immunohistochemistry',
        'Microscopy'
      ],

    "topics":[
      'Autism Spectrum Disorder (ASD)',
      'Attention Deficit Hyperactivity Disorder (ADHD)',
      'Conduct Disorder'
    ],
    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.researchgate.net/profile/Andreas-Chiocchetti'
    ],
    "content":"After attending this practical the students will know and be able to autonomously implement basic cell-biological techniques to study genetic variants in human neuronal cell models. These techniques include cell culture methods to study neuronal differentiation and to genetically modify DNA sequences using CRISPR/Cas9 as well as fluorescence and luciferase luminescence assays. After modification of the human neuronal progenitor cell lines several immuno-histochemical and morphological assays can be adapted to study and statistically analyze the hypothesized effects. In addition we offer basic insights into genome and transcriptome analysis."
    ,
    "objectives":"The state of the art molecular and cell-biological methods will be introduced to the students to analyze human neurons in vitro. This knowledge will be implemented by the students within an individual project designed together with the students. At the end of the practical experience the students will have the know-how to use human neuronal progenitor cell lines as cellular model for psychiatric disorders. In addition, within optional seminars and journal clubs, also in close collaboration with the adult psychiatry, the student can expand their current knowledge about underlying psychiatric conditions such as Autism Spectrum Disorder, Attention-DeficitHyperactivity-Disorder or Conduct Disorder."

  },

  {
    "code":"C3",
    "name":"Modelling and Simulation",
    "coordinators":["Prof. Gabriel Wittum"],
    "techniques":[
        'Mathematical modeling (Vector analysis)',
        'Mathematical modeling (conservation equations, constitutive relations)',
        'Mathematical modeling (Simulation techniques ODEs/PDEs)'
      ],

    "topics":[
      'Scientific computing',
      'Mathematical modeling',
      'Simulation techniques',
      'High-Performance Computing'
    ],
    "models":[
      'Computer'
    ],
    "location":"Westend",
    "semester":['Summer'],
    "links":[
      'https://scholar.google.de/citations?user=GYubNyUAAAAJ',
      'https://gcsc.uni-frankfurt.de/simulation-and-modelling'
    ],
    "content":"This module is equivalent to the module M-SIM 1: Modellierung und Simulation 1, offered in the Master course “Informatics”, Faculty 12 (Computer Science and Mathematics). It consists of a lecture (SIM1) and a practical course (SIM1-MPR). The lecture imparts: 1) Introduction to vector analysis: functions of several variables, derivatives and integrals, integral theorems. 2) Modeling: Modeling approaches, conservation equations, constitutive relations. 3) Simulation methods: a) Finite-difference methods for ordinary differential equations: consistency, convergence, stability. b) Discretisation methods for partial differential equations: Finite differences, finite elements. The practical offers complementary programming work to the lecture."
    ,
    "objectives":"Familiarity with the basics of modelling and numerical simulation"

  },

  {
    "code":"C4",
    "name":"Virtual Hippocampus : Introduction to Computational Neuroscience",
    "coordinators":["Prof. Dr. Peter Jedlicka"],
    "techniques":[
        'Computational modeling (synaptic models)',
        'Computational modeling (dendritic models)',
        'Computational modeling (single-neuron models)',
        'Computational modeling (network models)',
        'Programming (Python, NEURON)',
        'Data analysis'
      ],

    "topics":[
      'Modeling of hippocampal cells and networks',
      'Memory and learning',
      'Synaptic plasticity',
      'Molecular/cellular underpinnings of the role of dentate gyrus role in memory',
      'GABAergic inhibition on dendritic computation'
    ],

    "models":[
      'Computer'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/jedlicka/',
      'https://sites.google.com/site/peterjedlicka/'
    ],
    "content":"The practical and seminars provide an overview of computational and mathematical modeling of neural systems specifically focusing on modeling neurons and networks of the hippocampus. The course is an entry to the theoretical methods and approaches used to model the brain at different levels, ranging from synapses and dendrites to neurons and neural circuits. The aim is to learn standard techniques for building, managing, and using models that are closely linked to experimental data, especially those that involve hippocampal cells with complex anatomical and biophysical properties. Computational (in silico) experiments include large-scale network simulations in biophysically realistic and data-driven models of the hippocampus as well as single-cell simulations in morphologically reconstructed hippocampal neurons. In the accompanying seminars, the relevance of computational models for understanding the function of the brain is discussed using examples from recent research papers."
    ,
    "objectives":"basic cable and network modeling techniques; learning how to use NEURON (software for for empirically-based simulations of neurons and networks of neurons, http://www.neuron.yale.edu/neuron/); learning how to work on scientific questions based on relevant publications."
  },

  {
    "code":"C8",
    "name":"Systems Neuroscience : Sensorimotor and cognitive networks",
    "coordinators":["PD Dr. Christian Kell"],
    "techniques":[
        'Behavioral experiments',
        'Psychophysics',
        'Electrophysiology (EEG, MEG)',
        'Neuroimaging (fMRI)',
        'Statistics',
        'Data analysis'
      ],

    "topics":[
      'Linguistic processing and production in health and disease'
    ],

    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/kell/',
      'http://www.brainclocks.com/interests.php'
    ],
    "content":"The module introduces students on neural networks (cortical and subcortical) which are important for cognitive and sensomotoric processing. A main focus lies in the investigation of hemispheric lateralisation, mainly concerning linguistic processing and motor control of movements of the hand. Healthy volunteers and patients are examined in view of their behavioral reactions and under use of electric and magneto-encephalographic techniques. In addition, electrocorticographic data are raised by patients during brain operations. The students get familiarized with the used methods and acquire knowledge on the organisation principles of neural networks. The students will work on a specific fMRI case study in the first week of the module and then carry out behavioral tests and imaging experiments independently or under instructions as well as visit weekly seminars."
    ,
    "objectives":"Acquisition and analysis of human functional imaging or neurophysiological data (patients and/or healthy controls). Learning how to work on scientific questions based on relevant publications."

  },

  {
    "code":"C10",
    "name":"Computational neuroanatomy : quantitative analysis and modeling",
    "coordinators":["Dr. Hermann Cuntz"],
    "techniques":[
        'Image processing (microscopy data)',
        'Computational modeling (morphological models)',
        'Computational modeling (quantitative models)',
        'Computational modeling (biophysical models)',
        'Neuroanatomy',
        'Programming (Matlab)',
        'Data analysis'
      ],

    "topics":[
      'Wiring principles of neuronal circuits',
      'Dendritic structure and computations',
      'Morphological modeling'
    ],

    "models":[
      'Computer'
    ],
    "location":"Niederrad",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/cuntz/',
      'https://www.treestoolbox.org/hermann/'
    ],
    "content":"Based on neuroanatomical data from recent advances in microscopy and genetic techniques, we will generate models with a main focus on dendritic and axonal interactions. We will use image processing tools and quantitative analysis methods in the computer to digitise various anatomic components from microscopy image stacks. In their digital form, measured geometric properties can be matched to corresponding biophysical principles. For example, we can observe and measure the formation of neural circuits during development by using time-lapse imaging series. The measured structure of dendrites and axons then enables conclusions about connectivity and function in those circuits. The observed principles will then be tested in simple quantitative models. The module Computational Neuroanatomy will therefore bridge the way from data analysis to the generation of a scientific theory using simple computer models."
    ,
    "objectives":"The participants will learn to handle biological data using quantitative methods (incl. the usage of Matlab). They will further learn to generate simple models that reproduce the trends observed in these data. The projects will be selected to match the current research focus in the lab."

  },

  {
    "code":"C11",
    "name":"Computational Modeling of Neuronal Plasticity",
    "coordinators":["Prof. Dr. Jochen Triesch"],
    "techniques":[
        'Computational modeling (network models)',
        'Computational modeling (plasticity mechanisms)',
        'Programming (Python/Matlab/Java)',
        'Data analysis'

      ],

    "topics":[
      'Artificial and natural neural networks',
      'Plasticity mechanisms and rules',
      'Role of plasticity in network dynamics and learning'
    ],

    "models":[
      'Computer'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/triesch/',
      'https://www.fias.science/en/neuroscience/research-groups/jochen-triesch/'
    ],
    "content":"This lab course offers an introduction to the design and implementation of computer models of neural networks and the modeling of neuronal plasticity mechanisms. The course is a practical introduction to central methods of Computational Neuroscience, which investigates the functioning of the brain at multiple levels with the help of computational models. Participants implement and analyze standard neuron models and network architectures. The focus is on the role of plasticity mechanisms, their impact on network dynamics and their role in learning. The benefits and limitations of computer models for understanding brain function are discussed in the context of examples from the literature. Participants present their results in a talk and prepare a final report."
    ,
    "objectives":"Participants learn how to implement computer models of neural networks as well as different plasticity mechansisms and learning approaches. They learn to address a scientific question in the context of relevant literature"

  },

  {
    "code":"C12",
    "name":"Computational Neural Dynamics",
    "coordinators":["Dr. Tatjana Tchumatchenko"],
    "techniques":[
        'Mathematical modeling (single-neuron models)',
        'Mathematical modeling (network models)',
        'Mathematical modeling (analytical & numerical methods)',
        'Computational modeling (single-neuron models)',
        'Computational modeling (network models)',
        'Programming (Python/C/Matlab)'
      ],

    "topics":[
      'Spiking dynamics & connectivity of single neurons',
      'Collective phenomena of neuronal networks'
    ],

    "models":[
      'Computer'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/tchumatchenko/',
      'https://brain.mpg.de/tchumatchenko'
    ],
    "content":"Our aim will be to understand how connectivity and the spiking dynamics of individual neurons interact to give rise to complex collective phenomena such as information transmission, oscillations, or wave emergence in a neural network. We will use spiking neurons in computer simulations and pen-and-paper calculations to predict the dynamics emerging in a given network. Specifically, the students will write own code and will mostly work on new, open scientific problems that are not part of the textbook knowledge. The module Computational neural dynamics will therefore teach students to formulate own models, learn to solve or simulate these models, and teach them how to evaluate the findings and compare them to known biological observations. Among the effects, which we will include in the spiking network models, will be synaptic plasticity, firing rate adaptation, or different connectivity profiles."
    ,
    "objectives":"The participants will learn how to solve differential equations and write own computer code, e.g. in Python, C or Matlab. They will learn how to distill minimal theoretical models from physiological observations and published research. The student projects will be aligned with the ongoing research in the Tchumatchenko lab."

  },

  {
    "code":"C13",
    "name":"Models for Neural Circuit Development",
    "coordinators":["Dr. Julijana Gjorgjieva"],
    "techniques":[
        'Computational modeling (single-neuron/network models, plasticity mechanisms)',
        'Programming',
        'Calcium imaging (data analysis)',
        'Electrophysiology (data analysis)',
        'Data analysis',
      ],

    "topics":[
      'Visual cortex plasticity',
      'Sensory map and receptive field formation in visual cortex',
      'Topography, ocular dominance columns, direction selectivity',
      'Synaptic plasticity in biophysical neurons'
    ],

    "models":[
      'Computer'
    ],
    "location":"Riedberg",
    "semester":['Winter','Summer'],
    "links":[
      'https://brain.mpg.de/gjor',
      'https://brain.mpg.de/gjor'
    ],
    "content":"This module will focus on understanding the principles guiding the formation of sensory maps and receptive fields during the development of sensory circuits. The students will obtain an overview of existing models of the development of topography, ocular dominance columns, orientation and direction selectivity in the visual cortex. We will examine how different mechanisms including: emergence of diverse single neuron properties and activity-dependent synaptic plasticity interact during development to give rise to functional circuits. In addition to synaptic plasticity, which is more commonly studied, the focus will be on the role of the specific biophysical properties at the single neuron level. The students will have the opportunity to analyze (electrophysiological or Calcium imaging) data from visual cortex and build their own models of the assembly and tuning of developing neuronal circuits."
    ,
    "objectives":"Students will learn to analyze and interpret neural data, build and simulate computational models (e.g. in C, Matlab, or Python), and analyze model results in relation to experiments. Acquired skills include: statistical analysis, computer programming and simulations."

  },

  {
    "code":"C14",
    "name":"Cognitive Psychology : Attention, Perception & Memory",
    "coordinators":["Prof. Dr. Melissa Le-Hoa Vo"],
    "techniques":[
        'Study design',
        'Programming',
        'Data analysis (behavioral) ',
        'Psychophysics',
        'Electrophysiology (EEG, eye-tracking)',
        'Data analysis (EEG)',

      ],

    "topics":[
      'Visual attention',
      'Scene perception',
      'Memory'
    ],

    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Westend",
    "semester":['Winter'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/vo/',
      'https://www.scenegrammarlab.com/research/'
    ],
    "content":"This practical course provides an introduction to conducting research in Human Cognitive Science also known as Cognitive Psychology. In particular, students taking part will be able to gather hands-on experience in designing, programming, executing and analysing experiments in the areas of visual attention, scene perception, and memory. Depending on currently ongoing projects in the “Scene Grammar Lab”, the students can participate in neurocognitive studies using techniques such as EEG, eye tracking (both stationary and mobile ET glasses), and/or psychophysics. At the end of this practical course the students will have learned about the theoretical background of the projects, as well as data acquisition, data analysis, and interpretation of results. While we expect the students to work independently, the various members of the lab will be there to help where possible. As part of our weekly lab colloquium, students will be able to learn about other ongoing projects and will have the opportunity to present their work in this informal setting. At the end of the course, students are expected to write a brief paper (intro, methods, results, discussion) on the study they were working on."
    ,
    "objectives":"Reading up on theoretical backgrounds in the field of attention, perception, and memory, learning methods of experimental psychology, basics of acquisition and analysis of (neuro-)cognitive data, performing basic statistical analyses and writing a scientific paper."

  },


  {
    "code":"C15",
    "name":"Developmental Cognitive Neuroscience",
    "coordinators":["Prof. Dr. Yee Lee Shing"],
    "techniques":[
        'Study design',
        'Programming (Matlab/Python/R)',
        'Behavioral experiments',
        'Neuroimaging (fMRI)',
        'Data analysis (behavioral) ',
        'Data analysis (fMRI)',
        'Computational modeling'

      ],

    "topics":[
      'Lifespan cognitive development and brain plasticity',
      'Learning & Memory',
      'Environmental effects on development',
    ],

    "models":[
      'Humans (Homo sapiens)'
    ],
    "location":"Westend",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/mitglied/shing/',
      'https://www.psychologie.uni-frankfurt.de/69824239/005_Prof_-Yee-Lee-Shing'
    ],
    "content":"Our brain is highly plastic and undergoes dynamic changes across the lifespan. These developmental changes are reflected in modifications of cognitive functions, such as learning and memory. In our lab, we are interested in how the human brain and cognitive systems develop throughout the lifespan, particularly in how age-related neurocognitive changes influence the way we learn and extract regularities from the environment and our ability to create memories of unique experiences. For this, we conduct experiments in which we test participants of different age groups, using cognitive tasks designed to tap into specific processes involved in learning and memory. Depending on the stage of the experiment that you will work on, you may get experience in programming cognitive tasks, Matlab/Python/R programming, processing of behavioural/neuroimaging data, and/or conducting statistical/computational model analyses."
    ,
    "objectives":"In this elective module the students will get exposed to several techniques used to collect human experimental data: cognitive tasks to collect participants’ behavioural data, neuroimaging data while participants are performing tasks, and/or computational modeling of participants’ data. In addition, the students will learn how to design and program cognitive tasks, and they will learn different methods for analyze data, which will require them to learn Matlab/Python/R programming. The students will work in an international environment and learn how to write and communicate their results in English."

  },

  {
    "code":"D1",
    "name":"Behavioral Biology in Zoos",
    "coordinators":["Prof. Dr. Paul Dierkes"],
    "techniques":[
        'Zoology theory',
        'Zoo internship',
        'Behavioral experiments'
      ],

    "topics":[
      'Historical development of zoos',
      'Zoos and conservation',
      'Population biology',
      'Breeding programs at zoo',
      'Animal husbandry',
      'Veterinary',
      'Organization and structure development of zoos',
      'Enclosure design and planning',
      'Education at the zoo'
    ],

    "models":[
      'Zoo animals'
    ],
    "location":"Riedberg",
    "semester":['Summer'],
    "links":[
      'https://www.bio.uni-frankfurt.de/43969445/abtdierkes',
      'https://www.bio.uni-frankfurt.de/43969445/abtdierkes'
    ],
    "content":"The module consists of a seminar, an internship and excursion. Fundamental aspects and current issues of Zoology are taught in the seminar at the beginning based on original work, which will be presented by the students and then discussed as a group. The excursion to various zoos and a research internship in the 'Opel Zoo' serve to solidify theoretical principles. The focus will be on ecological, physiological and ethological research. Other topics include: historical development of zoos, zoos & conservation, population biology & breeding programs at the zoo, animal husbandry (nutrition, behaviour, enrichment, mixed species exhibits), veterinary fundamentals, organization and structural development, enclosure design and planning, education at the Zoo. The methodological approach to the practical components depends on the selected research focus, with classical to modern methods of behaviour research available. They may include laboratory activities (microscopic and physiological studies) and imaging techniques (such as thermographic measurements with infrared cameras or video analysis with high-speed cameras). The students present their results at the end of the module in the form of an oral presentation. In a further lecture they learn to critically appraise original work at the 'Opel Zoo'. These presentations will be held in English and students are given detailed feedback in terms of content and structure. By drafting a protocol in the form of a paper they become acquainted with the writing of a scientific publication. Following a detailed briefing on the methodology, planning, implementation, logging and analysis of the original data will be completed by the students independently."
    ,
    "objectives":"The students acquire basic principles in the field of zoo biology (behaviour research in the zoo, enrichment, husbandry, conservation aspects), as well as the application of modern imaging techniques. You will learn methodology for the implementation of behavioural studies and how to address scientific problems while bearing in mind current concepts in the relevant literature."

  },


  {
    "code":"EX0",
    "name":"External Course",
    "coordinators":["Professor X"],
    "techniques":[''],

    "topics":[''],

    "models":[''],
    "location":"Frankfurt",
    "semester":['Winter','Summer'],
    "links":[
      'https://www.izn-frankfurt.de/en/master/curriculum/'
    ],
    "content":"The practical provides basic methods and technologies in the neurosciences. The students work on own topical projects under instructions and introduce the results in the form of a seminar talk. They learn how to present scientific work through writing up an appropriate result protocol. The module can be offered by departments of the Goethe university, from other universities in Germany and foreign countries as well as by external-university research facilities."
    ,
    "objectives":"The students gain knowledge in the realisation of experiments in the area of the neurosciences. They learn working independently on scientific questions based on relevant publications"
  }

]
